lib/create_booking.rb

SELECT "tables".* FROM "tables" WHERE "tables"."number" IN ($1, $2) AND "tables"."restaurant_id" = $3  [["number", 3], ["number", 2], ["restaurant_id", 1]]
INSERT INTO "bookings" ("user_id", "restaurant_id", "time_from", "time_to") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["restaurant_id", 1], ["time_from", "2019-06-30 18:20:00"], ["time_to", "2019-06-30 17:50:00"]]
---
  def call(restaurant_id:, table_numbers:, user_id:, time_from:, time_to:)
    tables = Table.where(number: table_numbers, restaurant_id: restaurant_id)
    booking = Booking.new(user_id: user_id, tables: tables, time_from: time_from, time_to: time_to, restaurant_id: restaurant_id)
    booking_valid = ValidateBooking.new.call(booking)

    if booking_valid
      booking.save!