lib/validate_booking.rb

SELECT  1 AS one FROM "bookings" INNER JOIN "bookings_tables" ON "bookings_tables"."booking_id" = "bookings"."id" INNER JOIN "tables" ON "tables"."id" = "bookings_tables"."table_id" WHERE (time_from >= '2019-06-30 17:20:00' AND time_from < '2019-06-30 17:50:00' OR (time_to > '2019-06-30 17:20:00' AND time_to <= '2019-06-30 17:50:00')) AND (tables.id IN (2,3)) LIMIT $1  [["LIMIT", 1]]
---
  def validate_with_other_bookings(booking)
    restaurant = booking.restaurant
    intersect_bookings = Booking.joins(:tables)
                                .where("time_from >= :time_from AND time_from < :time_to OR (time_to > :time_from AND time_to <= :time_to)", time_from: booking.time_from, time_to: booking.time_to)
                                .where("tables.id IN (?)", booking.table_ids)

    return intersect_bookings.empty?